<a href="https://colab.research.google.com/github/Werick/Google_colab/blob/master/Copy_of_Data_Investigation_with_Pandas_II.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Data Investigation with Pandas II

## 1.0 Importing our Libraries

In [ ]:
# Importing the libraries we will need 

# Importing the pandas library
# 
import pandas as pd

# Importing the numpy library
import numpy as np

## 1.1 Reading the Dataset from our CSV file

This dataset contains trips taken by thousands of kenyans to and from Nairobi during the year 2018.

*   Dataset link for download or access: [Link](https://drive.google.com/a/moringaschool.com/file/d/1xe2sHapdeGo7bIaiG7UV0rjgQZ5U6OXv/view?usp=sharing)

In [ ]:
# Let's read the data from the CSV file and create the dataframe to be used
# 
df2=pd.read_csv("bus_travels.csv")

## 1.2 Previewing our Dataset

In [ ]:
# Let's preview the first 10 rows of our data
# 
df2=pd.read_csv("bus_travels.csv")
df2.head(10)

   ride_id travel_date travel_time travel_from travel_to car_type  max_capacity
0      247  07/05/2018       07:06       Kisii   Nairobi      Bus            49
1      256  06/05/2018       11:08       Kisii   Nairobi  shuttle            11
2      275  04/05/2018       05:00       Kisii   Nairobi  shuttle            11
3      285  04/05/2018       09:10       Kisii   Nairobi  shuttle            11
4      286  04/05/2018       09:20       Kisii   Nairobi  shuttle            11
5      287  04/05/2018       07:02       Kisii   Nairobi      Bus            49
6      288  04/05/2018       09:30       Kisii   Nairobi  shuttle            11
7      292  04/05/2018       19:03       Kisii   Nairobi      Bus            49
8      298  04/05/2018       09:00       Kisii   Nairobi  shuttle            11
9      302  04/05/2018       08:40       Kisii   Nairobi  shuttle            11

## 1.3 Accessing Information about our Dataset

In [ ]:
# Getting to know more about the dataset by accessing its information
#
df2=pd.read_csv("bus_travels.csv")
df2

      ride_id travel_date travel_time  ... travel_to car_type max_capacity
0         247  07/05/2018       07:06  ...   Nairobi      Bus           49
1         256  06/05/2018       11:08  ...   Nairobi  shuttle           11
2         275  04/05/2018       05:00  ...   Nairobi  shuttle           11
3         285  04/05/2018       09:10  ...   Nairobi  shuttle           11
4         286  04/05/2018       09:20  ...   Nairobi  shuttle           11
...       ...         ...         ...  ...       ...      ...          ...
1106    15336  07/05/2018       07:01  ...   Nairobi      Bus           49
1107    15337  07/05/2018       07:08  ...   Nairobi      Bus           49
1108    15338  07/05/2018       07:04  ...   Nairobi      Bus           49
1109    15339  07/05/2018       07:05  ...   Nairobi      Bus           49
1110    15344  09/05/2018       08:00  ...   Nairobi      Bus           49

[1111 rows x 7 columns]

## 1.4 Answering Questions

Let's answer the following questions with our dataset

In [ ]:
# Challenge 1
# How many trips were taken on the 22/04/18?
# 
OUR CODE GOES HERE

SyntaxError: ignored

In [ ]:
# Challenge 2
# Which type of vehicle travelled on 23/04/18 from Kisii to Nairobi at 7.15am?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 3
# How many trips were made from Kisii to Nairobi?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 4
# How many trips were made by shuttle from Nairobi?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 5
# How many trips were made by bus from Nairobi to Awendo?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 6
# Which was the most travelled from destination by bus?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 7
# Which was the most travelled to destination?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 8
# Which was the most travelled destination by bus?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 9
# Which town did not have a departure by shuttle?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 10
# Which were the most 5 travelled to destinations?
# 
OUR CODE GOES HERE

In [ ]:
# Challenge 11
# Which were the least 5 travelled to destinations?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 12
# If all shuttles travelled with full capacity, how many people travelled in shuttles from Kisii to Nairobi in the month of May?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 13
# Which date had the highest no. of trips in June?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 14
# On average, how many trips were made by all vehicles in a day?
#
OUR CODE GOES HERE

In [ ]:
# Challenge 15 
# On average, how many buses and shuttles travelled in a day?
# 
OUR CODE GOES HERE